Autodesk.Revit.DB.BuiltInFailures.GeolocationFailures.SurveyPointOutOfCRS
The survey point is outside the coordinate reference system.

Autodesk.Revit.DB.BuiltInFailures.GeolocationFailures
Failures related to geolocation.